app/Controllers/CategoriaController.php

    public function index(){
        $categorias = $this->categoriaModel->findAll();
---
SELECT *
FROM `categorias`

    public function show($id){
        $categoria = $this->categoriaModel->find($id);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '4'

    public function store()
{
    $data = [
        'nombre'      => $this->request->getPost('nombre'),
        'descripcion' => $this->request->getPost('descripcion'),
        'usuarios_id' => $this->request->getPost('usuarios_id'),
    ];

    $this->categoriaModel->save($data);
---
INSERT INTO `categorias` (`nombre`, `descripcion`, `usuarios_id`, `created_at`, `updated_at`) VALUES ('ashjdfhaskf', 'pepe', NULL, '2024-12-01 08:46:06', '2024-12-01 08:46:06')

    public function edit($id){
        $categoria = $this->categoriaModel->find($id);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '4'

    public function update($id)
{
    $data = [
        'nombre'      => $this->request->getPost('nombre'),
        'descripcion' => $this->request->getPost('descripcion'),
        'usuarios_id' => $this->request->getPost('usuarios_id'),
    ];

    $this->categoriaModel->update($id, $data);
---
UPDATE `categorias` SET `nombre` = 'jajaja', `descripcion` = 'futbol', `usuarios_id` = '7', `updated_at` = '2024-12-01 08:44:34'
WHERE `categorias`.`id` IN ('4')